tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "adoptopenjdk/openjdk"
tap "superbrothers/zsh-kubectl-prompt"
tap "blendle/blendle"

cask_args appdir: "/Applications"

brew "ack"
brew "binutils"
brew "ccat"
brew "coreutils"
brew "diffutils"
brew "direnv"
brew "findutils"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "gzip"
brew "jq"
brew "mas"
brew "moreutils"
brew "neovim"
brew "rename"
brew "rsync"
brew "screen"
brew "bash"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zplug"
brew "zsh"
brew "htop"
brew "stern"

brew "node"
brew "n"
brew "ruby"
brew "rust"
brew "lua"
brew "go"
brew "python"
brew "pyenv"
brew "rbenv"
brew "gradle"
brew "maven"

brew "mysql"
brew "redis"

brew "helm"
brew "kubernetes-cli"
brew "terraform"
brew "kubectx"
brew "circleci"
brew "awscli"
brew "azure-cli"
brew "serverless"
brew "datawire/blackbird/telepresence"
brew "zsh-kubectl-prompt"
brew "kns"

cask "google-cloud-sdk"
cask "1password"
cask "alfred"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "postman"
cask "paw"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "zoom"
cask "microsoft-teams"
cask "amazon-chime"
cask "sequel-ace"
cask "gitter"
cask "pritunl"
cask "muzzle"
cask "notion"
cask "miro"
cask "whatsapp"
cask "atom"
