tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "blendle/blendle"
tap "homebrew/cask-fonts"

cask_args appdir: "/Applications"

brew "coreutils"
brew "ccat"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "nvim"
brew "grep"
brew "gzip"
brew "jq"
brew "yq"
brew "rename"
brew "rsync"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zlib"
brew "htop"
brew "stern"
brew "vegeta"
brew "starship"
brew "fzf"
brew "stow"

brew "node"
brew "rust"
brew "lua"
brew "go"
brew "python"
brew "gradle"
brew "maven"
cask "graalvm/tap/graalvm-ce-java17"

brew "helm"
brew "kubernetes-cli"
brew "terraform"
brew "kubectx"
brew "circleci"
brew "awscli"
brew "azure-cli"
brew "serverless"
brew "datawire/blackbird/telepresence"
brew "kns"

cask "warp"
cask "pgadmin4"
cask "google-cloud-sdk"
cask "alfred"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "postman"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "transmission"
cask "zoom"
cask "microsoft-teams"
cask "amazon-chime"
cask "sequel-ace"
cask "gitter"
cask "discord"
cask "pritunl"
cask "muzzle"
cask "notion"
cask "miro"
cask "lastpass"
cask "whatsapp"
cask "cron"
cask "atom"
cask "docker"
cask "font-hack-nerd-font"
cask "transmit"
cask "vlc"
